---
kind: type
id: T:Autodesk.Revit.DB.GenericImportOptions
source: html/e3863d47-3717-5980-d4d0-b5ffb4af4188.htm
---
# Autodesk.Revit.DB.GenericImportOptions

Generic Import options.

## Syntax (C#)
```csharp
public abstract class GenericImportOptions
```